<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"be929a1a7863da16467fa97a91d19f09d83b53f0c00c3d195fb1d2cac0430689","plan_job_ref":"Job terraform Workflow new #40 at https://github.com/GlueOps/venkat-tofu-testing/actions/runs/8127772358","plan_out_hash":"0e9b1ddf92c8363ad5acd844e5ca051914b1cbcac5b249c0e6cc254f4d0efbec","plan_hash":"7643fb081ac967e4dbb9c6b8664ef75722be9b50e97a1043de0903a41e318d8c","plan_text_format":"diff","version":"1.42.0","closed":true} -->
OpenTofu plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # cloudflare_record.fake-domain-record will be created
+   resource "cloudflare_record" "fake-domain-record" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "yolo-tofu"
+       proxiable       = (known after apply)
+       ttl             = 3600
+       type            = "A"
+       value           = "8.8.8.8"
+       zone_id         = "********************************"
    }

  # random_integer.priority will be created
+   resource "random_integer" "priority" {
+       id     = (known after apply)
+       max    = 500
+       min    = 1
+       result = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform Workflow new #41](https://github.com/GlueOps/venkat-tofu-testing/actions/runs/8127778445)